---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireConduitTypeSet
source: html/26739cf5-2d70-2e82-71b8-63c03e3bdc75.htm
---
# WireConduitTypeSet Methods

Removes every conduit type from the set, rendering it empty.